
## Plan Result (prod)

[CI link](https://github.com/marufeuille/ClearBag/actions/runs/22298641482)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_project_iam_member.github_actions_prod[&#34;roles/monitoring.admin&#34;]
  * module.monitoring.google_monitoring_alert_policy.job_failure
  * module.monitoring.google_monitoring_notification_channel.email


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_member.github_actions_prod["roles/monitoring.admin"] will be created
  + resource "google_project_iam_member" "github_actions_prod" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions-deploy-prod@marufeuille-linebot.iam.gserviceaccount.com"
      + project = "marufeuille-linebot"
      + role    = "roles/monitoring.admin"
    }

  # module.monitoring.google_monitoring_alert_policy.job_failure will be created
  + resource "google_monitoring_alert_policy" "job_failure" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Cloud Run Job Failure - school-agent-v2-prod"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "marufeuille-linebot"

      + alert_strategy {
          + auto_close = "604800s"
        }

      + conditions {
          + display_name = "Cloud Run Job failed execution"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "0s"
              + filter          = <<-EOT
                    resource.type = "cloud_run_job"
                    AND resource.labels.job_name = "school-agent-v2-prod"
                    AND metric.type = "run.googleapis.com/job/completed_execution_count"
                    AND metric.labels.result = "failed"
                EOT
              + threshold_value = 0

              + aggregations {
                  + alignment_period   = "300s"
                  + per_series_aligner = "ALIGN_COUNT"
                }
            }
        }
    }

  # module.monitoring.google_monitoring_notification_channel.email will be created
  + resource "google_monitoring_notification_channel" "email" {
      + display_name        = "Email - marufeuille@gmail.com"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "marufeuille@gmail.com"
        }
      + name                = (known after apply)
      + project             = "marufeuille-linebot"
      + type                = "email"
      + verification_status = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":31,"Program":"tfcmt","SHA1":"4e845d49c7ef4842725d6387b91b0daeecee30e1","Target":"prod","Vars":{},"WorkflowName":"terraform plan prod"} -->